app/views/customers/show.html.erb

        <p>Products: </p>
        <% order.products.each do |product| %>
---
SELECT "products".* FROM "products" INNER JOIN "orders_products" ON "products"."id" = "orders_products"."product_id" WHERE "orders_products"."order_id" = $1  [["order_id", 2]]