app/views/orders/index.html.erb

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
---
  <% if order.customer %>
    <h4> <%= order.customer.first_name %>