app/views/orders/show.html.erb

SELECT "products".* FROM "products" INNER JOIN "orders_products" ON "products"."id" = "orders_products"."product_id" WHERE "orders_products"."order_id" = $1  [["order_id", 1]]
---
    <h3>Products</h3>
    <% @order.products.each do |product| %>