app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"  WHERE "customers"."last_name" = 'Tommy'
SELECT  "customers".* FROM "customers"   ORDER BY "customers"."created_at" DESC LIMIT 15
---
  def index
    if params[:q]
      @customers = Customer.where("LOWER(first_name) LIKE LOWER(?)", "%#{params[:q]}%").concat(Customer.where("LOWER(last_name) LIKE LOWER(?)", "%#{params[:q]}%")).uniq
    else
      @customers = Customer.order(created_at: :desc).first(15)

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "orders".* FROM "orders"  WHERE "orders"."customer_id" = $1  [["customer_id", 1]]
---
  def show
    @customer = Customer.find(params[:id])
    @orders = @customer.orders

INSERT INTO "customers" ("address", "alt_phone_num", "city", "created_at", "email", "first_name", "last_name", "phone_num", "state", "updated_at", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @customer = Customer.create(customer_params)

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1 LIMIT 1  [["id", 2]]
---
  def update
    @customer = Customer.find(params[:id])

DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 5]]
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1 LIMIT 1  [["id", 5]]
---
  def destroy
    @customer = Customer.find(params[:id]).destroy