app/controllers/orders_controller.rb

  def index
    @orders = Order.order(created_at: :desc).first(15)
---
SELECT  "orders".* FROM "orders"   ORDER BY "orders"."created_at" DESC LIMIT 15

  def new
    @customer = Customer.find(params[:customer_id].to_i)
    @order = Order.new
    @product = Product.new
    @user = User.find(1)
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  def create
    @order = Order.create(order_params)
---
INSERT INTO "orders" ("assembly", "balance_due", "complete", "created_at", "customer_id", "delivery", "deposit", "follow_up_date", "gift_note", "grand_total", "items_total", "notes", "placed_by", "placed_date", "purchased_by", "tax", "total_with_tax", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

  def update
    @order = Order.find(params[:id])
    @order.update(order_params)
---
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "orders" SET "balance_due" = $1, "delivery" = $2, "grand_total" = $3, "items_total" = $4, "tax" = $5, "total_with_tax" = $6, "updated_at" = $7 WHERE "orders"."id" = 6  [["balance_due", 90000], ["delivery", 456], ["grand_total", 90000], ["items_total", 90000], ["tax", 5175], ["total_with_tax", 95175], ["updated_at", "2014-10-14 07:50:54.922603"]]

  def destroy
    Order.find(params[:id]).destroy
---
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 4]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1  [["id", 4]]