app/controllers/products_controller.rb

  def index
    if params[:date]
      @pick_up_products = Product.where(pick_up_date: params[:date]).order(updated_at: :asc)
      @pick_up_date = params[:date]
    else
      @pick_up_products = Product.where(pick_up_date: Date.today).order(updated_at: :asc)
    end

    if params[:q]
      query = params[:q]
      @products = Product.where("LOWER(company) LIKE LOWER(?)", "%#{query}%").order(created_at: :desc).concat(Product.where("LOWER(model_type) LIKE LOWER(?)", "%#{query}%")).concat(Product.where("LOWER(description) LIKE LOWER(?)", "%#{query}%")).uniq
    else
      @products = Product.order(created_at: :desc).first(15)
---
SELECT  "products".* FROM "products"   ORDER BY "products"."created_at" DESC LIMIT 15

  def create
    @order = Order.find(product_order_id_params[:order_id].to_i)
    @product = Product.create(product_params)
    if @product.valid? == false
      redirect_to "/orders/#{product_order_id_params[:order_id]}"
    else
      @order.update(updated_by:"#{current_user.first_name}")
      @product.errors.clear
      @order.products << @product
      @order = @product.orders.first
---
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = $1 LIMIT 1  [["id", 0]]
INSERT INTO "products" ("company", "created_at", "description", "model_type", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["company", "OO"], ["created_at", "2014-10-02 23:34:02.273260"], ["description", "OO"], ["model_type", "OO"], ["price", 77], ["updated_at", "2014-10-02 23:34:02.273260"]]
UPDATE "orders" SET "total_with_tax" = $1, "updated_at" = $2 WHERE "orders"."id" = 5  [["total_with_tax", 3598657], ["updated_at", "2014-10-14 07:40:27.024804"]]
SELECT "products".* FROM "products" INNER JOIN "orders_products" ON "products"."id" = "orders_products"."product_id" WHERE "orders_products"."order_id" = $1  [["order_id", 5]]

  def destroy
    @product = Product.find(params[:id])
    @order = @product.orders.first
    @order.update(updated_by:"#{current_user.first_name}")
    @product.destroy
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 30]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 30]]